---
type: DirectShapeLibrary
namespace: Autodesk.Revit.DB
version: 2024
members: 10
tags: [revit-api, class]
---

# DirectShapeLibrary

`Autodesk.Revit.DB.DirectShapeLibrary` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | AddDefinition | — | `` |
| Method | AddDefinitionType | 2015 | `public void AddDefinitionType ( string id , ElementId typeId )` |
| Method | Contains | 2015 | `public bool Contains ( string id )` |
| Method | ContainsType | 2015 | `public bool ContainsType ( string name )` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | FindDefinition | 2015 | `public IList < GeometryObject > FindDefinition ( string id )` |
| Method | FindDefinitionType | 2015 | `public ElementId FindDefinitionType ( string id )` |
| Method | GetDirectShapeLibrary | 2015 | `public static DirectShapeLibrary GetDirectShapeLibrary ( Document ADoc )` |
| Method | Reset | 2015 | `public void Reset ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |